"""Tìm các cặp số nguyên tố sexy
https://en.wikipedia.org/wiki/Sexy_prime
"""

def is_prime(n):
    """Kiểm tra n có là số nguyên tố hay không."""
    if n == int(n) and n < 2: return False
    i = 2
    while i * i <= n:
        if n % i == 0: return False
        i += 1
    return True
        
def is_sexy_prime(n):
    """Kiểm tra (n,n+6) có là cặp số nguyên tố sexy hay không."""
    return is_prime(n) and is_prime(n+6)

def main():
    print(f'Các cặp số nguyên tố sexy nhỏ hơn 1000 là:')
    for i in range(2,1000):
        if is_sexy_prime(i):
            print((i,i+6), end = ' ')

if __name__ == '__main__':
    main()


""" the output must be:
(5, 11) (7, 13) (11, 17) (13, 19) (17, 23) (23, 29) (31, 37) (37, 43) (41, 47) (47, 53) (53, 59) (61, 67) (67, 73) (73, 79) (83, 89) (97, 103) (101, 107) (103, 109) (107, 113) (131, 137) (151, 157) (157, 163) (167, 173) (173, 179) (191, 197) (193, 199) (223, 229) (227, 233) (233, 239) (251, 257) (257, 263) (263, 269) (271, 277) (277, 283) (307, 313) (311, 317) (331, 337) (347, 353) (353, 359) (367, 373) (373, 379) (383, 389) (433, 439) (443, 449) (457, 463) (461, 467) (503, 509) (541, 547) (557, 563) (563, 569) (571, 577) (587, 593) (593, 599) (601, 607) (607, 613) (613, 619) (641, 647) (647, 653) (653, 659) (677, 683) (727, 733) (733, 739) (751, 757) (821, 827) (823, 829) (853, 859) (857, 863) (877, 883) (881, 887) (941, 947) (947, 953) (971, 977) (977, 983) (991, 997)
"""
    
